server/express-20-plain.out
Running 1m test @ http://localhost:3000/plain
  2 threads and 200 connections
  Thread calibration: mean lat.: 1.175ms, rate sampling interval: 10ms
  Thread calibration: mean lat.: 6.125ms, rate sampling interval: 19ms
  Thread Stats   Avg      Stdev     Max   +/- Stdev
    Latency     2.84ms    2.58ms  14.90ms   75.95%
    Req/Sec   529.19      0.87k    5.55k    96.18%
  59422 requests in 1.00m, 13.49MB read
Requests/sec:    990.34
Transfer/sec:    230.18KB
Running 1m test @ http://localhost:3000/plain
  2 threads and 200 connections
  Thread calibration: mean lat.: 1.223ms, rate sampling interval: 10ms
  Thread calibration: mean lat.: 5.877ms, rate sampling interval: 19ms
  Thread Stats   Avg      Stdev     Max   +/- Stdev
    Latency     3.25ms    3.08ms  14.01ms   76.60%
    Req/Sec   529.35      0.85k    5.55k    95.98%
  59423 requests in 1.00m, 13.49MB read
Requests/sec:    990.36
Transfer/sec:    230.18KB
Running 1m test @ http://localhost:3000/plain
  2 threads and 200 connections
  Thread calibration: mean lat.: 0.859ms, rate sampling interval: 10ms
  Thread calibration: mean lat.: 0.867ms, rate sampling interval: 10ms
  Thread Stats   Avg      Stdev     Max   +/- Stdev
    Latency     0.86ms  444.08us   6.14ms   68.55%
    Req/Sec   535.80    121.23     1.00k    52.34%
  59842 requests in 1.00m, 13.58MB read
Requests/sec:    997.35
Transfer/sec:    231.81KB