server/fastify-22-plain.out
Running 1m test @ http://localhost:3000/plain
  2 threads and 200 connections
  Thread calibration: mean lat.: 0.788ms, rate sampling interval: 10ms
  Thread calibration: mean lat.: 2.135ms, rate sampling interval: 10ms
  Thread Stats   Avg      Stdev     Max   +/- Stdev
    Latency     1.43ms    1.03ms   5.65ms   70.35%
    Req/Sec   522.95      1.51k   11.11k    97.00%
  59425 requests in 1.00m, 9.12MB read
Requests/sec:    990.36
Transfer/sec:    155.71KB
Running 1m test @ http://localhost:3000/plain
  2 threads and 200 connections
  Thread calibration: mean lat.: 0.743ms, rate sampling interval: 10ms
  Thread calibration: mean lat.: 0.754ms, rate sampling interval: 10ms
  Thread Stats   Avg      Stdev     Max   +/- Stdev
    Latency   756.78us  398.02us   2.12ms   66.08%
    Req/Sec   525.91    126.50     1.00k    72.00%
  59842 requests in 1.00m, 9.19MB read
Requests/sec:    997.35
Transfer/sec:    156.81KB
Running 1m test @ http://localhost:3000/plain
  2 threads and 200 connections
  Thread calibration: mean lat.: 0.742ms, rate sampling interval: 10ms
  Thread calibration: mean lat.: 0.767ms, rate sampling interval: 10ms
  Thread Stats   Avg      Stdev     Max   +/- Stdev
    Latency   757.35us  399.72us   2.15ms   65.70%
    Req/Sec   526.21    124.30     1.00k    46.69%
  59842 requests in 1.00m, 9.19MB read
Requests/sec:    997.36
Transfer/sec:    156.81KB